head [5,4,3,2,1] 取首元素
tail 除首元素之外其余元素
last 最后一个元素
init 除last之外其余元素
length [1,2,3] 返回长度
null [1,2,2] 检查空
reverse [5,4,3,2,1] 反转
take 3 [5,4,3,2,1] 取前三个元素
drop 3 [8,4,2,1,5,6] 丢弃前三个
minimum [8,4,2,1,5,6] 
maximum [1,9,2,3,4]
sum [5,2,1,6,3,2,5,7] 
product [6,2,1,2]
4 `elem` [3,4,5,6]  4是否存在于list，常用中缀
[1..20] 一到20
['a'..'z'] 得到 "abcdefghijklmnopqrstuvwxyz"
['K'..'Z'] 得到 "KLMNOPQRSTUVWXYZ"
[2,4..20] 指定间隔 [2,4,6,8,10,12,14,16,18,20]
[3,6..20] 指定间隔 [3,6,9,12,15,18]
得到20到1 [20,19..1]
[0.1, 0.3 .. 1] 使用浮点数小心 [0.1,0.3,0.5,0.7,0.8999999999999999,1.0999999999999999]
取前 24 個 13 的倍數 可以 [13,26..24*13]，但有更好的方法： take 24 [13,26..]
take 10 (cycle [1,2,3]) 得到 [1,2,3,1,2,3,1,2,3,1]
take 12 (cycle "LOL ") 得到 "LOL LOL LOL "
take 10 (repeat 5) 得到 [5,5,5,5,5,5,5,5,5,5]，用 replicate 3 10 更简单得到 [10,10,10]
[x*2 | x <- [1..10]] 得到 [2,4,6,8,10,12,14,16,18,20]
[x*2 | x <- [1..10], x*2 >= 12] 得到 [12,14,16,18,20]  逗号分隔限制条件
[ x | x <- [50..100], x `mod` 7 == 3] 得到 [52,59,66,73,80,87,94]
boomBangs xs = [ if x < 10 then "BOOM!" else "BANG!" | x <- xs, odd x] 使 List 中所有大於 10 的奇數變為 "BANG"，小於 10 的奇數變為 "BOOM"，其他則統統扔掉
boomBangs [7..13]  得到 ["BOOM!","BOOM!","BANG!","BANG!"]
[ x | x <- [10..20], x /= 13, x /= 15, x /= 19] 得到 [10,11,12,14,16,17,18,20]
[ x*y | x <- [2,5,10], y <- [8,10,11]] 得到 [16,20,22,40,50,55,80,100,110]
[ x*y | x <-[2,5,10], y <- [8,10,11], x*y > 50] 加个筛选 [55,80,100,110]
length' xs = sum [1 | _ <- xs]  自己实现length
removeNonUppercase st = [ c | c <- st, c `elem` ['A'..'Z']]  取大写字母
fst ("Wow", False) 返回首项 "Wow"
snd ("Wow", False) 返回尾项 False  注意这两种只能用于大小为2的tuple
zip [1 .. 5] ["one", "two", "three", "four", "five"] 得到 交叉组装 [(1,"one"),(2,"two"),(3,"three"),(4,"four"),(5,"five")]






